combined/BEEGFS-all-master-node/fio-barenode-write-unbuffered-block_512k-size_4G-threads_2.log
fio-beegfs-write-unbuffered-block_512k-size_4G-threads_2: (g=0): rw=rw, bs=512K-512K/512K-512K/512K-512K, ioengine=psync, iodepth=1
...
fio-2.2.10
Starting 2 processes
fio-beegfs-write-unbuffered-block_512k-size_4G-threads_2: Laying out IO file(s) (4 file(s) / 16384MB)
fio-beegfs-write-unbuffered-block_512k-size_4G-threads_2: Laying out IO file(s) (4 file(s) / 16384MB)

fio-beegfs-write-unbuffered-block_512k-size_4G-threads_2: (groupid=0, jobs=2): err= 0: pid=3517183: Wed Nov 21 13:56:39 2018
  write: io=90094MB, bw=384394KB/s, iops=750, runt=240003msec
    clat (usec): min=1373, max=11443, avg=2654.62, stdev=721.47
     lat (usec): min=1381, max=11450, avg=2661.98, stdev=721.47
    clat percentiles (usec):
     |  1.00th=[ 1944],  5.00th=[ 1976], 10.00th=[ 1992], 20.00th=[ 2024],
     | 30.00th=[ 2064], 40.00th=[ 2448], 50.00th=[ 2640], 60.00th=[ 2896],
     | 70.00th=[ 2960], 80.00th=[ 3024], 90.00th=[ 3152], 95.00th=[ 3568],
     | 99.00th=[ 5408], 99.50th=[ 6560], 99.90th=[ 9280], 99.95th=[ 9536],
     | 99.99th=[10304]
    bw (KB  /s): min=126722, max=210103, per=50.05%, avg=192403.09, stdev=15088.04
    lat (msec) : 2=14.01%, 4=83.19%, 10=2.77%, 20=0.02%
  cpu          : usr=0.39%, sys=10.63%, ctx=1121679, majf=0, minf=3479
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=180187/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: io=90094MB, aggrb=384394KB/s, minb=384394KB/s, maxb=384394KB/s, mint=240003msec, maxt=240003msec

CPU idleness:
  system: 94.23%
  unit work: mean=52.99us, stddev=2.34