combined/BEEGFS-all-master-node/fio-barenode-write-unbuffered-block_512k-size_4G-threads_4.log
fio-beegfs-write-unbuffered-block_512k-size_4G-threads_4: (g=0): rw=rw, bs=512K-512K/512K-512K/512K-512K, ioengine=psync, iodepth=1
...
fio-2.2.10
Starting 4 processes
fio-beegfs-write-unbuffered-block_512k-size_4G-threads_4: Laying out IO file(s) (4 file(s) / 16384MB)
fio-beegfs-write-unbuffered-block_512k-size_4G-threads_4: Laying out IO file(s) (4 file(s) / 16384MB)
fio-beegfs-write-unbuffered-block_512k-size_4G-threads_4: Laying out IO file(s) (4 file(s) / 16384MB)
[...]

fio-beegfs-write-unbuffered-block_512k-size_4G-threads_4: (groupid=0, jobs=4): err= 0: pid=3696678: Thu Nov 22 00:27:40 2018
  write: io=92148MB, bw=393156KB/s, iops=767, runt=240004msec
    clat (usec): min=1745, max=21468, avg=5199.74, stdev=933.19
     lat (usec): min=1750, max=21472, avg=5207.09, stdev=933.19
    clat percentiles (usec):
     |  1.00th=[ 3888],  5.00th=[ 3952], 10.00th=[ 4048], 20.00th=[ 4512],
     | 30.00th=[ 4768], 40.00th=[ 4960], 50.00th=[ 5088], 60.00th=[ 5408],
     | 70.00th=[ 5600], 80.00th=[ 5856], 90.00th=[ 6048], 95.00th=[ 6368],
     | 99.00th=[ 8640], 99.50th=[10688], 99.90th=[11840], 99.95th=[12224],
     | 99.99th=[14784]
    bw (KB  /s): min=84485, max=106283, per=25.02%, avg=98379.83, stdev=4369.34
    lat (msec) : 2=0.01%, 4=8.61%, 10=90.72%, 20=0.67%, 50=0.01%
  cpu          : usr=0.26%, sys=4.89%, ctx=1084539, majf=0, minf=3810
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=184295/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: io=92148MB, aggrb=393156KB/s, minb=393156KB/s, maxb=393156KB/s, mint=240004msec, maxt=240004msec

CPU idleness:
  system: 98.54%
  unit work: mean=55.42us, stddev=3.03