combined/BEEGFS-all-master-node/fio-barenode-write-unbuffered-block_64k-size_2G-threads_2.log
fio-beegfs-write-unbuffered-block_64k-size_2G-threads_2: (g=0): rw=rw, bs=64K-64K/64K-64K/64K-64K, ioengine=psync, iodepth=1
...
fio-2.2.10
Starting 2 processes
fio-beegfs-write-unbuffered-block_64k-size_2G-threads_2: Laying out IO file(s) (4 file(s) / 8192MB)
fio-beegfs-write-unbuffered-block_64k-size_2G-threads_2: Laying out IO file(s) (4 file(s) / 8192MB)

fio-beegfs-write-unbuffered-block_64k-size_2G-threads_2: (groupid=0, jobs=2): err= 0: pid=3450401: Wed Nov 21 10:08:18 2018
  write: io=84942MB, bw=362416KB/s, iops=5662, runt=240001msec
    clat (usec): min=278, max=93004, avg=350.57, stdev=181.77
     lat (usec): min=279, max=93005, avg=351.43, stdev=181.77
    clat percentiles (usec):
     |  1.00th=[  294],  5.00th=[  302], 10.00th=[  310], 20.00th=[  318],
     | 30.00th=[  322], 40.00th=[  330], 50.00th=[  334], 60.00th=[  342],
     | 70.00th=[  350], 80.00th=[  362], 90.00th=[  386], 95.00th=[  422],
     | 99.00th=[  644], 99.50th=[  756], 99.90th=[ 1496], 99.95th=[ 4576],
     | 99.99th=[ 6240]
    bw (KB  /s): min=137344, max=191616, per=50.02%, avg=181275.22, stdev=6349.96
    lat (usec) : 500=97.79%, 750=1.69%, 1000=0.36%
    lat (msec) : 2=0.08%, 4=0.02%, 10=0.05%, 20=0.01%, 100=0.01%
  cpu          : usr=1.19%, sys=14.44%, ctx=3924436, majf=0, minf=26507
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=1359065/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: io=84942MB, aggrb=362415KB/s, minb=362415KB/s, maxb=362415KB/s, mint=240001msec, maxt=240001msec

CPU idleness:
  system: 97.55%
  unit work: mean=55.08us, stddev=1.85