combined/BEEGFS-all-master-node/fio-barenode-write-unbuffered-block_64k-size_2G-threads_4.log
fio-beegfs-write-unbuffered-block_64k-size_2G-threads_4: (g=0): rw=rw, bs=64K-64K/64K-64K/64K-64K, ioengine=psync, iodepth=1
...
fio-2.2.10
Starting 4 processes
fio-beegfs-write-unbuffered-block_64k-size_2G-threads_4: Laying out IO file(s) (4 file(s) / 8192MB)
fio-beegfs-write-unbuffered-block_64k-size_2G-threads_4: Laying out IO file(s) (4 file(s) / 8192MB)
fio-beegfs-write-unbuffered-block_64k-size_2G-threads_4: Laying out IO file(s) (4 file(s) / 8192MB)
[...]

fio-beegfs-write-unbuffered-block_64k-size_2G-threads_4: (groupid=0, jobs=4): err= 0: pid=3587572: Wed Nov 21 17:56:35 2018
  write: io=89715MB, bw=382782KB/s, iops=5980, runt=240001msec
    clat (usec): min=273, max=16538, avg=666.17, stdev=302.96
     lat (usec): min=274, max=16538, avg=667.04, stdev=302.96
    clat percentiles (usec):
     |  1.00th=[  478],  5.00th=[  506], 10.00th=[  516], 20.00th=[  540],
     | 30.00th=[  548], 40.00th=[  564], 50.00th=[  580], 60.00th=[  596],
     | 70.00th=[  628], 80.00th=[  676], 90.00th=[ 1004], 95.00th=[ 1272],
     | 99.00th=[ 1448], 99.50th=[ 1544], 99.90th=[ 5088], 99.95th=[ 6432],
     | 99.99th=[ 7648]
    bw (KB  /s): min=82816, max=101376, per=25.02%, avg=95758.24, stdev=3572.41
    lat (usec) : 500=3.81%, 750=81.05%, 1000=5.08%
    lat (msec) : 2=9.81%, 4=0.14%, 10=0.11%, 20=0.01%
  cpu          : usr=0.64%, sys=6.91%, ctx=3387173, majf=0, minf=29572
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=1435439/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: io=89715MB, aggrb=382782KB/s, minb=382782KB/s, maxb=382782KB/s, mint=240001msec, maxt=240001msec

CPU idleness:
  system: 94.45%
  unit work: mean=53.32us, stddev=4.32